Revit 2027 API
BuiltInFailures.GlobalParameterFailures.GlobalParamFormulaCircularChain Property
 A formula in a global parameter causes a circular chain of references between highlighted elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GlobalParamFormulaCircularChain { get; }
Public Shared ReadOnly Property GlobalParamFormulaCircularChain As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GlobalParamFormulaCircularChain {
	FailureDefinitionId^ get ();
}
static member GlobalParamFormulaCircularChain : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace